/**
 * **************************************************************************************** *
 * app启动入口                                                                              *
 * src为源码，使用es6，开发环境使用babel-node进行实时编译，在此之前使用eslint进行代码检测   *
 * dist为babel编译后的es5文件，可以生产环境执行                                             *
 * **************************************************************************************** *
*/

const app = process.env.NODE_ENV === 'development' ? require('./src/index') : require('./dist/index');
app.default.start();
